tap "caskroom/cask"
tap "caskroom/drivers"
tap "homebrew/bundle"
tap "homebrew/core"
tap "buo/cask-upgrade"


# brews
brew "carthage"
brew "ffmpeg"
brew "gnupg"
brew "htop"
brew "imagemagick"
brew "iperf3"
brew "irssi"
brew "mas"
brew "ncdu"
brew "nmap"
brew "pngcrush"
brew "speedtest-cli"
brew "watch"
brew "wget"
brew "youtube-dl"

# app casks
# arduino requires java.  proceed at your own risk.
# cask "arduino"
cask "atom"
cask "arq"
cask "chromium"
cask "coda"
cask "etcher"
cask "google-chrome"
# cask "gqrx"
# cask "hwsensors"
# cask "intel-power-gadget"
cask "istat-menus"
# cask "jollysfastvnc"
cask "keybase"
# cask "little-snitch"
cask "milkytracker"
# cask "netbeans"
cask "omnidisksweeper"
# cask "omnigraffle"
# cask "omniplan"
cask "piezo"
# cask "psequel"
cask "slack"
cask "steermouse"
cask "synthesia"
cask "tranquility"
cask "the-hit-list"
cask "viscosity"
cask "vlc"
# cask "wireshark"
cask "wwdc"
# cask "xquartz"

# mac app store
mas "1Password", id: 443987910
mas "Cathode", id: 499233976
mas "Deliveries", id: 924726344
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "RadarScope", id: 432027450
mas "The Unarchiver", id: 425424353
mas "Transmit", id: 403388562
mas "Tweetbot", id: 557168941
#mas "Xcode", id: 497799835
