tap "homebrew/bundle"

# brews
brew "bat"
brew "bettercap"
brew "binsider"
brew "binutils"
brew "binwalk"
# brew "carthage"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "curl"
brew "cyme"
brew "esptool"
brew "ffmpeg"
brew "gnupg"
brew "gnu-sed"
# brew "gpg1"
brew "go"
brew "hexyl"
brew "htop"
brew "imagemagick"
brew "influxdb-cli"
brew "iperf3"
brew "irssi"
brew "jq"
brew "macmon"
brew "mas"
brew "micro"
brew "mosquitto"
brew "mqttui"
brew "ncdu"
brew "netcat"
brew "ninja"
brew "nmap"
brew "open-ocd"
# brew "platformio"
brew "picocom"
brew "pngcrush"
brew "qemu"
brew "qrencode"
brew "speedtest-cli"
brew "telnet"
brew "tmux"
brew "tio"
brew "watch"
brew "wget"
# brew "youtube-dl"
brew "yt-dlp"

# app casks

cask "altair-graphql-client"
# cask "balenaetcher" # use caligula instead
# cask "blackhole-2ch" # mostly not needed anymore
cask "chromium"
# cask "coda" # use nova instead
cask "firefox"
# cask "google-chrome" # try to get by with chromium
cask "hex-fiend"
cask "iina"
# cask "inav-configurator"
# cask "hwsensors"
# cask "intel-power-gadget"
cask "istat-menus"
# cask "jollysfastvnc"
cask "kaleidoscope"
# cask "karabiner-elements" # try to use qmk instead
cask "keybase"
# cask "little-snitch"
cask "milkytracker"
# cask "netbeans"
cask "nova"
cask "obs"
cask "omnidisksweeper"
cask "omnigraffle"
# cask "omniplan"
# cask "piezo"
# cask "psequel" # RIP
# cask "postman"
cask "proxyman"
cask "saleae-logic"
cask "serial"
cask "slack"
cask "steermouse"
# cask "the-hit-list" # RIP
cask "tower"
# cask "tranquility"
# cask "virtualbox"
# cask "viscosity"
cask "visual-studio-code"
cask "vlc"
# cask "wireshark"
cask "wwdc"
cask "xcodes"
# cask "xquartz"

# mac app store
# 1Password now installed as a cask.  kmo 2019-07-13
# mas "1Password", id: 443987910
# mas "Cathode", id: 499233976
mas "Capo", id: 696977615
mas "Deliveries", id: 290986013
mas "Flame", id: 325206381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PCalc", id: 403504866
mas "Pixelmator", id: 407963104
mas "RadarScope", id: 432027450
mas "The Unarchiver", id: 425424353
mas "Transmit", id: 403388562
# 557168941 = tweetbot 2.0
# mas "Tweetbot", id: 557168941
# 1384080005 = tweetbot 3.0
# mas "Tweetbot 3 for Twitter", id: 1384080005 # RIP
# mas "Xcode", id: 497799835 # install from Xcodes

tap "qmk/qmk"
brew "qmk"

brew "font-jetbrains-mono-nerd-font"
