tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
brew "carthage"
brew "ffmpeg"
brew "gnupg"
brew "htop"
brew "imagemagick"
brew "iperf3"
brew "mas"
brew "ncdu"
brew "nmap"
brew "pngcrush"
brew "youtube-dl"
cask "atom"
cask "etcher"
cask "keybase"
mas "1Password", id: 443987910
mas "Cathode", id: 499233976
mas "Deliveries", id: 924726344
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "RadarScope", id: 432027450
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Transmit", id: 403388562
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
